{"abstract":"In this talk, fitness assignment in multiobjective evolutionary algorithms is interpreted as a multi-criterion decision process. A suitable decision making framework based on goals and priorities is formulated in terms of a relational operator, characterized, and shown to encompass a number of simpler decision strategies, including constraint satisfaction, lexicographic optimization, and a form of goal programming. Then, the ranking of an arbitrary number of candidates is considered, and the ef- fect of preference changes on the cost surface seen by an evolutionary algorithm is illustrated graphically for a simple problem. The formulation of a multiobjective genetic algorithm based on the pro- posed decision strategy is also discussed. Niche formation techniques are used to promote diversity among preferable candidates, and progressive articulation of preferences is shown to be possible as long as the genetic algorithm can recover from abrupt changes in the cost landscape. Finally, an application to the optimization of the low-pressure spool speed governor of a Pegasus gas turbine engine is described, which il- lustrates how a technique such as the Multiobjective Genetic Algorithm can be applied, and exemplifies how design requirements can be refined as the algorithm runs. The two instances of the problem studied demonstrate the need for pref- erence articulation in cases where many and highly competing objectives lead to a non-dominated set too large for a finite population to sample ef- fectively. It is shown that only a very small portion of the non-dominated set is of practical relevance, which further substantiates the need to sup- ply preference information to the GA.","authors":["Carlos M. Fonseca","Peter J. Fleming"],"title":"Multiobjective Optimization and Multiple Constraint Handling with Evolutionary Algorithms: A Unified Formulation","pub_id":221025610,"citee":[],"citedBy":[],"URL":"https:\/\/www.researchgate.net\/publication\/221025610_Multiobjective_Optimization_and_Multiple_Constraint_Handling_with_Evolutionary_Algorithms_A_Unified_Formulation"}