{"abstract":"We propose a novel way to induce a random field from an energy function on discrete labels. It amounts to locally injecting noise to the energy potentials, followed by finding the global minimum of the perturbed energy function. The resulting Perturb-and-MAP random fields harness the power of modern discrete energy minimization algorithms, effectively transforming them into efficient random sampling algorithms, thus extending their scope beyond the usual deterministic setting. In this fashion we can enjoy the benefits of a sound probabilistic framework, such as the ability to represent the solution uncertainty or learn model parameters from training data, while completely bypassing costly Markov-chain Monte-Carlo procedures typically associated with discrete label Gibbs Markov random fields (MRFs). We study some interesting theoretical properties of the proposed model in juxtaposition to those of Gibbs MRFs and address the issue of principled design of the perturbation process. We present experimental results in image segmentation and scene labeling that illustrate the new qualitative aspects and the potential of the proposed model for practical computer vision applications.","authors":["Alan L. Yuille"],"title":"Perturb-and-MAP random fields: Using discrete optimization to learn and sample from energy models","_id":221111135,"citee":[3085610,224839692,222826454,6336345,220345500,2383342,220184077,216792742,221362512,221618793,225209253,242070701,220419669,220182914,2869096,224136111,260869405,243769716,224164338,11207765,8337762,220660389,221304335,221345986,6731814,41224942,3193315,266005429,258222788,229058134],"citedBy":[285598250,282613694,277723496,279633530,267759902,261226306,289678999,261353869,225053824,261116009,261336889,262311939,234066650,262398911,267966905,273101920,283757069,283619674,288060301],"URL":"https:\/\/www.researchgate.net\/publication\/221111135_Perturb-and-MAP_random_fields_Using_discrete_optimization_to_learn_and_sample_from_energy_models"}