{"abstract":"ABSTRACT A major factor hindering the deployment of a fully functional automatic facial expression detection system is the lack of representative data. A solution to this is to narrow the context of the target application, so enough data is available to build robust models so high performance can be gained. Automatic pain detection from a patient's face represents one such application. To facilitate this work, researchers at McMaster University and University of Northern British Columbia captured video of participant's faces (who were suffering from shoulder pain) while they were performing a series of active and passive range-of-motion tests to their affected and unaffected limbs on two separate occasions. Each frame of this data was AU coded by certified FACS coders, and self-report and observer measures at the sequence level were taken as well. This database is called the UNBC-McMaster Shoulder Pain Expression Archive Database. To promote and facilitate research into pain and augment current datasets, we have publicly made available a portion of this database which includes: (1) 200 video sequences containing spontaneous facial expressions, (2) 48,398 FACS coded frames, (3) associated pain frame-by-frame scores and sequence-level self-report and observer measures, and (4) 66-point AAM landmarks. This paper documents this data distribution in addition to describing baseline results of our AAM\/SVM system. This data will be available for distribution in March 2011.","authors":[],"title":"Painful data: The UNBC-McMaster shoulder pain expression archive database","_id":221292544,"citee":[49628576,21663578,223065452,221259802,200085999,230574153,3193633,225940935,49796150,215992302,243773603,228715647,4194011,246700567,6139644,5348301,224401018,221052632,26820517,221786192,3948108,42803851,2900541,3193260,23493444,4082379,233894838,20540394],"citedBy":[267155572,281811172,277312235,282478275,278763516,281276273,262331528,254257855,254257602,259972003,237148069,259714804,248703363,234689229,259972200,261387182,221430193,236333646,281276268,265742258,261154876,261387567,267843517,224950389,230554292,260658411,261115617,261484972,261468526,261319546,260353896,262215758,257093268,261319549,237148056,259495667,257692298,259990719,261194617,258082273,271456386,271545529,260519620,283023938,272741013,274094896,274721882,275355521,274461344,277311895,280098467,273488773,283854672],"URL":"https:\/\/www.researchgate.net\/publication\/221292544_Painful_data_The_UNBC-McMaster_shoulder_pain_expression_archive_database"}