{"abstract":"ABSTRACT Regression density estimation is the problem of flexibly estimating a response distribution as a function of covariates. An important approach to regression density estimation uses finite mixture models and our article considers flexible mixtures of heteroscedastic regression (MHR) models where the response distribution is a normal mixture, with the component means, variances and mixture weights all varying as a function of covariates. Our article develops fast variational approximation methods for inference. Our motivation is that alternative computationally intensive MCMC methods for fitting mixture models are difficult to apply when it is desired to fit models repeatedly in exploratory analysis and model choice. Our article makes three contributions. First, a variational approximation for MHR models is described where the variational lower bound is in closed form. Second, the basic approximation can be improved by using stochastic approximation methods to perturb the initial solution to attain higher accuracy. Third, the advantages of our approach for model choice and evaluation compared to MCMC based approaches are illustrated. These advantages are particularly compelling for time series data where repeated refitting for one step ahead prediction in model choice and diagnostics and in rolling window computations is very common. Supplemental materials for the article are available online.","authors":["David J. Nott","Siew Li Tan"],"title":"Regression Density Estimation With Variational Methods and Stochastic Approximation","_id":254295504,"citee":[228890245,33020867,4791217,233871583,11042141,4742321,246452549,4993340,222573532,4744329,46494854,4943744,220286466,223748248,39729845,4902448,222662604,44843129,1903443,2354248,3084564,3114818,4745818,2306327,233806999,265620884,6307266,47278489,234108809,246299386,3769512,221619568,2239690,11066023,229101040,2871298,222822628,222666782,222548735,220274302,2660592,257701806],"citedBy":[259578079,230732835,51966591,233806999,228083473,237082504,233861270,259106327,279309917],"URL":"https:\/\/www.researchgate.net\/publication\/254295504_Regression_Density_Estimation_With_Variational_Methods_and_Stochastic_Approximation"}