{"abstract":"ABSTRACT This article addresses the problem of derivative-free (single- or multi-objective) optimization subject to multiple inequality constraints. Both the objective and constraint functions are assumed to be smooth, non-linear and expensive to evaluate. As a consequence, the number of evaluations that can be used to carry out the optimization is very limited, as in complex industrial design optimization problems. The method we propose to overcome this difficulty has its roots in the Bayesian and the multiobjective optimization literatures. More specifically, an extended domination rule is used to handle the constraints and a corresponding Bayesian expected hyper-volume improvement sampling criterion is proposed. This new criterion extends existing Bayesian sampling criteria to the multi-objective constrained case, and makes it possible to start the algorithm without an initial feasible point. The calculation and optimization of the criterion are performed using Sequential Monte Carlo techniques. In particular, an algorithm similar to the subset simulation method, which is well known in the field of structural reliability, is used to estimate the expected hyper-volume improvement criterion. The method, which we call BMOO (for Bayesian Multi-Objective Optimization), is compared to state-of-the-art algorithms for single-objective and multi-objective constrained optimization problems.","authors":["Paul Féliot","Julien Bect","Emmanuel Vazquez"],"title":"A Bayesian approach to constrained single- and multi-objective optimization","pub_id":282570552,"citee":[24168169,49458431,222546544,45280500,216457235,46587486,200806059,226031060,220742835,228438518,265543262,258163201,232805135,2526557,4993330,4181106,235709727,221025610,261065571,284219670,272521912,285458515,265209813,4201703,228754624,220514418,3418871,221228406,244959955,228445426,215446267,237548813,268702047,242922491,248818761,257299288,220702165,216301271,232875897,263244902,41222435,228789130,216301381,216301386,216301383,216301407,274553583,247644014,254230112,264936662,1960302,216457295,227227789,269996418,220381030,2386811],"citedBy":[],"URL":"https:\/\/www.researchgate.net\/publication\/282570552_A_Bayesian_approach_to_constrained_single-_and_multi-objective_optimization"}