{"abstract":"ABSTRACT Upper bounds are established for the probability that, in sampling without replacement from a finite population, the sample sum exceeds its expected value by a specified amount. These are obtained as corollaries of two main results. Firstly, a useful upper bound is derived for the moment generating function of the sum, leading to an exponential probability inequality and related moment inequalities. Secondly, maximal inequalities are obtained, extending Kolmogorov's inequality and the Hajek-Renyi inequality. Compared to sampling with replacement, the results incorporate sharpenings reflecting the influence of the sampling fraction, $n\/N$, where $n$ denotes the sample size and $N$ the population size. We go somewhat beyond previous work by Hoeffding (1963) and Sen (1970). As in the latter reference, martingale techniques are exploited. Applications to simple linear rank statistics are noted, dealing with the two-sample Wilcoxon statistic as an example. Finally, the question of sharpness of the exponential bounds is considered.","authors":["R. J. Serfling"],"title":"Probability Inequalities for the Sum in Sampling without Replacement","_id":38357750,"citee":[],"citedBy":[280589952,274703698,266561017,262603168,259483032,256606492,232718573,51914398,44709800,45866850,224472264,225153796,231999479,254400021,254723884,237338109,228444589,268166926,222465340,233252350,250754735,227245590,254910386,233030324,220320003,243101415,220343428,223128265,225808934,221497339,227127476,230291919,23421148,221008772,220543135,45863992,224109760,220124448,221754520,230629591,260354186,257841301,235223020,255795593,261501975,236248103,236834702,236240995,253646492,255730885,266611816,278701271,261700480,244990056,262301947,262604266,262805496,264553768,270985367,278623534,267395868,267454175,268819880,269417285,274094732,279310073,279458710,279633530,280064346,290348486,281028960],"URL":"https:\/\/www.researchgate.net\/publication\/38357750_Probability_Inequalities_for_the_Sum_in_Sampling_without_Replacement"}