{"abstract":"Hidden Markov random field (HMRF) models are widely used for image segmentation, as they appear naturally in problems where a spatially constrained clustering scheme is asked for. A major limitation of HMRF models concerns the automatic selection of the proper number of their states, i.e., the number of region clusters derived by the image segmentation procedure. Existing methods, including likelihood- or entropy-based criteria, and reversible Markov chain Monte Carlo methods, usually tend to yield noisy model size estimates while imposing heavy computational requirements. Recently, Dirichlet process (DP, infinite) mixture models have emerged in the cornerstone of nonparametric Bayesian statistics as promising candidates for clustering applications where the number of clusters is unknown a priori; infinite mixture models based on the original DP or spatially constrained variants of it have been applied in unsupervised image segmentation applications showing promising results. Under this motivation, to resolve the aforementioned issues of HMRF models, in this paper, we introduce a nonparametric Bayesian formulation for the HMRF model, the infinite HMRF model, formulated on the basis of a joint Dirichlet process mixture (DPM) and Markov random field (MRF) construction. We derive an efficient variational Bayesian inference algorithm for the proposed model, and we experimentally demonstrate its advantages over competing methodologies.","authors":["Gabriel Tsechpenakis"],"title":"The Infinite Hidden Markov Random Field Model","_id":44572779,"citee":[38357862,233950933,224881748,224327452,6545061,221669680,262362546,259014834,229647197,227661917,220182914,221618341,3906114,223013541,220501639,221995544,3320517,261021839,222220125,3193596,38357646,4993246,229100346,3320514,225797350,38358303,43481745,38326987,221363233,226435002,254212736,221364240,221618582,2348531,220323155,220939223,234363825,37597291,4207400,3193384,229100417,2553280,3906161,38357634,226287966],"citedBy":[235960199,237036856,228900414,224199347,49776687,278694825,220227421,225060683,257484782,290594478,261225758,260353896,262353148,237036706,236228177,237035291,259140108,260521748,261370855,259993500,272027411,275673268,273488773],"URL":"https:\/\/www.researchgate.net\/publication\/44572779_The_Infinite_Hidden_Markov_Random_Field_Model"}